<script setup></script>

<template>
  <div class="container h-screen py-16 recipe dark:bg-black overflow-y-scroll">
    <img
      src="../assets/images/category/biriyani.jpg"
      alt=""
      class="max-w-full w-full mb-5 max-h-52"
    />
    <h2 class="text-2xl font-medium dark:text-white mb-2">কাচ্চি বিরিয়ানি</h2>
    <p>| ২ ঘন্টা | ৮ জন |</p>
    <h3 class="text-xl font-normal dark:text-white my-2">উপাদানগুলি:</h3>
    <ul class="dark:text-white">
      <li>২ কেজি খাসি বা গরুর মাংস</li>
      <li>১ কেজি চিনিগুড়া বা কালিজিড়া চাল</li>
      <li>১/২ কাপ টক দই</li>
      <li>২ টেবিল চামচ আদা বাটা</li>
      <li>২ টেবিল চামচ রসুন বাটা</li>
      <li>৪/৫ টা শুকনা মরিচ</li>
      <li>বড় সাইজের একটির অর্ধেক জয়ফল</li>
      <li>মিডিয়াম সাইজ এর একটি জয়ত্রী</li>
      <li>১/২ চা চামচ সাদা গোল মরিচ</li>
      <li>৪/৫ টি দারুচিনি</li>
      <li>৮/১০ টি সাদা এলাচ</li>
      <li>২টি কালো এলাচ</li>
      <li>১/২ চা চামচ কালো গোল মরিচ</li>
      <li>৮/১০ টি কিসমিস</li>
      <li>৩/৪ কাপ তেল</li>
      <li>১ কাপ ঘি</li>
      <li>৪ টি আলু (মাঝারি সাইজ)</li>
      <li>৫-৬ টি আলু বোখারা</li>
      <li>১ কাপ গুড়া দুধ</li>
      <li>আড়াই কাপ লিকুইড দুধ</li>
      <li>১ কাপ পেয়াজ বেরেস্তা</li>
      <li>১ টি তারা মৌরি</li>
      <li>২ চা চামচ শা-জিরা</li>
      <li>৭/৮ টি লবঙ্গ</li>
      <li>৩ টি তেজপাতা</li>
      <li>৫/৬ টি কাবাব চিনি</li>
      <li>৮-১০ টা কাজু বাদাম</li>
      <li>পরিমানমত লবণ</li>
    </ul>
    <h3 class="text-xl font-normal dark:text-white my-2">প্রস্তুত প্রণালি:</h3>
    <p>মাংস ভাল করে ধুয়ে নিন। খুব ভালো করে পানি ঝরিয়ে নিন।</p>
    <p>
      এবার বিরিয়ানি মশলার মিশ্রণ তৈরি করুন। তারা মৌরি, কালো এলাচ, সাদা এলাচ,
      শুকনো মরিচ, জয়ফল, জয়ত্রী, গোল মরিচ, সাদা গোল মরিচ, লবঙ্গ, তেজপাতা ও
      দারুচিনি দিয়ে গুড়ো করে নিন।
    </p>
    <p>
      আলু বড় টুকরো করে কেটে সামান্য লবন ও রঙের জন্য হলুদ গুড়া বা জাফরান গুড়ার
      সাথে মেখে তেলে বাদামি করে ভেজে তুলে রাখুন।
    </p>
    <p>
      টকদই, আদা-রসুন বাটা, লবন, গুড়া করে রাখা মশলা, তেল ও পেয়াজ বেরেস্তা দিয়ে
      মাংস ভালো ভাবে মেরিনেট করে নিন। এখন ধোয়ার ফ্লেভার যাদের পছন্দ তারা কয়লা
      দিয়ে স্মেল দিয়ে নিতে পারেন। আমরা পছন্দ করি না তাই বাদ দিলাম৷ ২ থেকে ৪
      ঘন্টা রেখে দিন মেরিনেট হওয়ার জন্য।
    </p>
    <p>
      একটি পাত্রে পরিমানমত পানি দিন। পানিতে তেল, লবন, দারুচিনি, এলাচ, তারা মৌরি,
      লবঙ্গ ও তেজপাতা দিয়ে দিন। পানি ফুটতে শুরু করলে চাল দিন। ৭০% মত সেদ্ধ হলে
      নামিয়ে পানি ঝরিয়ে নিন।
    </p>
    <p>
      যে পাত্রে বিরিয়ানী রান্না করবেন সেই পাত্রে প্রথমে মাংস দিন। তারপর ভেজে
      রাখা আলু ও আলু বোখারা দিন। উপর থেকে পেয়াজ বেরাস্তা, গুড়া দুধ, কাবাব চিনি,
      কিসমিস ও শাহি জিরা ছড়িয়ে দিন । এবার তার উপর সেদ্ধ করে রাখা ভাত ছড়িয়ে দিন।
      আরও একটু বেরেস্তা ছড়িয়ে দিন। এবার ঘি, দুধ ও গুড়া দুধ-এর একটি ম্রিশন তৈরি
      করে উপর থেকে ছড়িয়ে দিন।
    </p>
    <p>
      এবার আটা দিয়ে নরম খামির তৈরি করুন। খামির দিয়ে পাত্রের চারপাশে লাগিয়ে খুব
      ভাল করে ঢাকনা বন্ধ করুন যেন কোন বাতাস বের হতে না পারে।
    </p>
    <p>
      এবার প্রথম ১০ মিনিট হাই হিট-এ রান্না করুন। তারপর একদম অল্প আচে চুলার উপর
      একটি প্যান বা তাওয়া বসিয়ে তার উপর হাড়ি রেখে রান্না করুন দেড় থেকে ২ ঘন্টা।
      ২ ঘন্টা পরে চেক করুন। আপনার বিরিয়ানী রেডি। পছন্দসই সালাদ বা রাইতার সাথে
      পরিবেশন করুন।
    </p>
  </div>
</template>

<style scoped>
.recipe p {
  @apply text-base;
  @apply mb-1;
  @apply dark:text-white;
}

/* scrollbar */
.recipe {
  scrollbar-width: thin;
  scrollbar-color: #888 #f1f1f1;
}

.dark .recipe {
  scrollbar-color: #fff transparent;
}
</style>
