import { defineStore } from "pinia";

export const useRecipes = defineStore("recipes", {
    state: () => {
        return {
            category: [
                {
                    id: 1,
                    title: "বিরিয়ানি রেসিপি",
                    img: "https://img.freepik.com/free-photo/gourmet-chicken-biryani-with-steamed-basmati-rice-generated-by-ai_188544-13480.jpg"
                },
                {
                    id: 2,
                    title: "কাবাব রেসিপি",
                    img: "https://img.freepik.com/free-photo/grilled-meat-skewers-with-vegetables-gourmet-summer-appetizer-generated-by-ai_188544-55981.jpg"
                },
                {
                    id: 3,
                    title: "খিচুরি, পোলাও",
                    img: "https://img.freepik.com/premium-photo/picture-patla-khichuri_871710-28414.jpg"
                },
                {
                    id: 4,
                    title: "ভেজিটেবল",
                    img: "https://img.freepik.com/free-photo/picture-vegetables-fruits-with-blue-background_1340-23458.jpg"
                },
                {
                    id: 5,
                    title: "মাছের রেসিপি",
                    img: "https://img.freepik.com/premium-photo/fried-fish-carp-fresh-vegetable-salad-wooden-background_2829-1105.jpg"
                },
                {
                    id: 6,
                    title: "ভর্তা রেসিপি",
                    img: "https://img.freepik.com/premium-photo/ilish-bhorta-hilsa-served-dish-isolated-background-top-view-bangladesh-food_689047-5312.jpg"
                },
                {
                    id: 7,
                    title: "সালাদ",
                    img: "https://img.freepik.com/premium-photo/fresh-vegetable-salad-with-feta-cheese-food-top-view-free-space-your-text_187166-21463.jpg"
                },
                {
                    id: 8,
                    title: "স্যুপ",
                    img: "https://img.freepik.com/free-photo/tomato-soup-with-green-table_140725-2447.jpg"
                },
                {
                    id: 9,
                    title: "ফাস্ট ফুড",
                    img: "https://img.freepik.com/premium-photo/burger-with-veal-cheese-vegetables-fast-food-wooden-background-top-view-free-space-your-text_187166-22955.jpg"
                },
                {
                    id: 10,
                    title: "ড্রিংক",
                    img: "https://img.freepik.com/free-photo/cocktail-glasses_144627-34955.jpg"
                },
                {
                    id: 11,
                    title: "আচার",
                    img: "https://img.freepik.com/free-photo/fresh-sweet-ripe-tamarind-white-surface_1150-41897.jpg"
                },
                {
                    id: 12,
                    title: "কেক",
                    img: "https://img.freepik.com/free-photo/chocolate-cake-decorated-with-forest-fruits-blueberries-strawberries-blackberries-ai-generative_123827-24044.jpg"
                },
                {
                    id: 13,
                    title: "পিঠা",
                    img: "https://img.freepik.com/premium-photo/this-food-is-made-rice-powder-sugar-oil-this-item-is-called-tele-vaga-pitha-bangladesh-it-is-so-delicious_799261-727.jpg"
                },
                {
                    id: 14,
                    title: "নাস্তা",
                    img: "https://img.freepik.com/free-photo/breakfast-set-table_140725-9332.jpg"
                },
                {
                    id: 15,
                    title: "ডেজার্ট",
                    img: "https://img.freepik.com/free-photo/tartlets-with-pistachios-strawberry-cream-chocolate-side-view_141793-4156.jpg"
                },
                {
                    id: 16,
                    title: "অন্যান্য",
                    img: "https://img.freepik.com/free-photo/top-view-table-full-delicious-food-composition_23-2149141349.jpg"
                },
            ],
            recipe: [
                {
                    id: 1,
                    category: 1,
                    title: "কাচ্চি বিরিয়ানি",
                    img: "https://img.freepik.com/free-photo/gourmet-chicken-biryani-with-steamed-basmati-rice-generated-by-ai_188544-13480.jpg",
                    favorite: true,
                    time: "৮ জন",
                    people: "২ ঘন্টা",
                    content: `<h3 class="text-xl font-normal dark:text-white my-2">উপাদানগুলি:</h3> <ul class="dark:text-white"> <li>২ কেজি খাসি বা গরুর মাংস</li> <li>১ কেজি চিনিগুড়া বা কালিজিড়া চাল</li> <li>১/২ কাপ টক দই</li> <li>২ টেবিল চামচ আদা বাটা</li> <li>২ টেবিল চামচ রসুন বাটা</li> <li>৪/৫ টা শুকনা মরিচ</li> <li>বড় সাইজের একটির অর্ধেক জয়ফল</li> <li>মিডিয়াম সাইজ এর একটি জয়ত্রী</li> <li>১/২ চা চামচ সাদা গোল মরিচ</li> <li>৪/৫ টি দারুচিনি</li> <li>৮/১০ টি সাদা এলাচ</li> <li>২টি কালো এলাচ</li> <li>১/২ চা চামচ কালো গোল মরিচ</li> <li>৮/১০ টি কিসমিস</li> <li>৩/৪ কাপ তেল</li> <li>১ কাপ ঘি</li> <li>৪ টি আলু (মাঝারি সাইজ)</li> <li>৫-৬ টি আলু বোখারা</li> <li>১ কাপ গুড়া দুধ</li> <li>আড়াই কাপ লিকুইড দুধ</li> <li>১ কাপ পেয়াজ বেরেস্তা</li> <li>১ টি তারা মৌরি</li> <li>২ চা চামচ শা-জিরা</li> <li>৭/৮ টি লবঙ্গ</li> <li>৩ টি তেজপাতা</li> <li>৫/৬ টি কাবাব চিনি</li> <li>৮-১০ টা কাজু বাদাম</li> <li>পরিমানমত লবণ</li> </ul> <h3 class="text-xl font-normal dark:text-white my-2">প্রস্তুত প্রণালি:</h3> <p>মাংস ভাল করে ধুয়ে নিন। খুব ভালো করে পানি ঝরিয়ে নিন।</p> <p> এবার বিরিয়ানি মশলার মিশ্রণ তৈরি করুন। তারা মৌরি, কালো এলাচ, সাদা এলাচ, শুকনো মরিচ, জয়ফল, জয়ত্রী, গোল মরিচ, সাদা গোল মরিচ, লবঙ্গ, তেজপাতা ও দারুচিনি দিয়ে গুড়ো করে নিন। </p> <p> আলু বড় টুকরো করে কেটে সামান্য লবন ও রঙের জন্য হলুদ গুড়া বা জাফরান গুড়ার সাথে মেখে তেলে বাদামি করে ভেজে তুলে রাখুন। </p> <p> টকদই, আদা-রসুন বাটা, লবন, গুড়া করে রাখা মশলা, তেল ও পেয়াজ বেরেস্তা দিয়ে মাংস ভালো ভাবে মেরিনেট করে নিন। এখন ধোয়ার ফ্লেভার যাদের পছন্দ তারা কয়লা দিয়ে স্মেল দিয়ে নিতে পারেন। আমরা পছন্দ করি না তাই বাদ দিলাম৷ ২ থেকে ৪ ঘন্টা রেখে দিন মেরিনেট হওয়ার জন্য। </p> <p> একটি পাত্রে পরিমানমত পানি দিন। পানিতে তেল, লবন, দারুচিনি, এলাচ, তারা মৌরি, লবঙ্গ ও তেজপাতা দিয়ে দিন। পানি ফুটতে শুরু করলে চাল দিন। ৭০% মত সেদ্ধ হলে নামিয়ে পানি ঝরিয়ে নিন। </p> <p> যে পাত্রে বিরিয়ানী রান্না করবেন সেই পাত্রে প্রথমে মাংস দিন। তারপর ভেজে রাখা আলু ও আলু বোখারা দিন। উপর থেকে পেয়াজ বেরাস্তা, গুড়া দুধ, কাবাব চিনি, কিসমিস ও শাহি জিরা ছড়িয়ে দিন । এবার তার উপর সেদ্ধ করে রাখা ভাত ছড়িয়ে দিন। আরও একটু বেরেস্তা ছড়িয়ে দিন। এবার ঘি, দুধ ও গুড়া দুধ-এর একটি ম্রিশন তৈরি করে উপর থেকে ছড়িয়ে দিন। </p> <p> এবার আটা দিয়ে নরম খামির তৈরি করুন। খামির দিয়ে পাত্রের চারপাশে লাগিয়ে খুব ভাল করে ঢাকনা বন্ধ করুন যেন কোন বাতাস বের হতে না পারে। </p> <p> এবার প্রথম ১০ মিনিট হাই হিট-এ রান্না করুন। তারপর একদম অল্প আচে চুলার উপর একটি প্যান বা তাওয়া বসিয়ে তার উপর হাড়ি রেখে রান্না করুন দেড় থেকে ২ ঘন্টা। ২ ঘন্টা পরে চেক করুন। আপনার বিরিয়ানী রেডি। পছন্দসই সালাদ বা রাইতার সাথে পরিবেশন করুন। </p>`

                },
                {
                    id: 2,
                    category: 1,
                    title: "চিকেন বিরিয়ানি",
                    img: "https://img.freepik.com/free-photo/plate-biryani-with-bowl-chicken-vegetables_505751-3813.jpg?",
                    favorite: false,
                    time: "৮ জন",
                    people: "২ ঘন্টা",
                    content: `<h3>চিকেন বিরিয়ানি রান্নার উপকরণ</h3> <p>১) বাসমতী চাল ৫০০ গ্রাম </p> <p>২) চিকেন ১ কেজি </p> <p>৩) টক দই ১ কাপ </p> <p>৪) পেঁয়াজ বড় ২ টা </p> <p>৫) রসুন বাটা ১ টেবিল চামচ </p> <p>৬) আদা বাটা ১ টেবিল চামচ </p> <p>৭) হলুদ গুঁড়ো ২ চা চামচ । </p> <p>৮) জায়ফল আধা চা চামচ </p> <p>৯) জয়িত্রী আধা চা চামচ ।</p> <p>১০) ধনিয়া গুড়া ১ চা চামচ ।</p> <p>১১) জীরা গুড়া ১ চা চামচ ।</p> <p>১২) মরিচ গুড়া ১ চা চামচ ।</p> <p>১৩) গরম মসলা গুড়া দেড় চা চামচ ।</p> <p>১৪) গোলাপ জল আধা চা চামচ ।</p> <p>১৫) এলাচ ৩-৪ টা ।</p> <p>১৬) দারচিনি ২ টুকরা ।</p> <p>১৭) তেজপাতা ৩ টুকরা ।</p> <p>১৮) লবণ পরিমান মতো ।</p> <p>১৯) বিরিয়ানি মসলা ১ টেবিল চামচ ।</p> <p>২০) লবঙ্গ ৫-৬ টা ।</p> <p>২১) ঘি ২ টেবিল চামচ ।</p> <p>২২) তেল ১ কাপ ।</p> <p>২৩) কাঁচা মরিচ বাটা ২ চা চামচ ।</p> <p>২৪) পেঁয়াজ বাটা ২ টেবিল চামচ ।</p> <h3>চিকেন বিরিয়ানি রান্নার প্রস্তুত প্রণালী </h3> <p>১) প্রথমে একটি পাত্রে মুরগী নিয়ে তাতে একে একে আদা বাটা , রসুন বাটা , জীরা গুড়া , ধনিয়া গুড়া , টক দই , মরিচের গুড়া , জায়ফল , জয়ত্রী গুড়া , গরম মসলা গুড়া , লবন এবং পেঁয়াজ মরিচ বাটা ভালোভাবে মাখিয়ে এক ঘণ্টা রেখে দিতে হবে ।</p> <p>২) এবার একটি প্যান এ তেল দিয়ে গরম হয়ে গেলে পেঁয়াজ কুঁচি ভেজে নিতে হবে । পেঁয়াজ সামান্য ভাজা হয়ে গেলে তাতে মেরিনেট করে রাখা মুরগী দিয়ে দিতে হবে ।</p> <p>মুরগী ভালোভাবে কষিয়ে রান্না করে নিতে হবে । এবার হয়ে গেলে নামিয়ে নিতে হবে ।</p> <p>৩) এবার চাল ভালোভাবে ধুয়ে পানি ঝড়িয়ে নিতে হবে ।</p> <p>৪) এরপর একটি প্যানে তেল ও ঘি গরম করে তাতে পেঁয়াজ কুঁচি , এলাচ , দারুচিনি , তেজপাতা , লবঙ্গ দিয়ে ভেজে নিতে হবে ।</p> <p>পেঁয়াজ লাল লাল ভাজা হলে তাতে আদা ও রসুন বাটা দিয়ে নাড়তে হবে । এবার চাল দিয়ে তাতে লবণ দিয়ে ভালোভাবে নেড়ে ভেজে নিতে হবে ।</p> <p>৫) ভাজা হয়ে গেলে তাতে গরম পানি দিয়ে অল্প আঁচে রান্না করে নিতে হবে ।</p> <p>৬) পানি কমে আসলে তাতে আগে থেকে রান্না করে রাখা মুরগী দিয়ে নেড়ে দিতে হবে । এবার বিরিয়ানি মসলা ছড়িয়ে দিয়ে নেড়ে দিতে হবে । কিছুক্ষন অল্প আঁচে রান্না করে নিতে হবে ।</p> <p>৭) এবার হয়ে এলে গোলাপ জল ছিটিয়ে দিতে হবে ।</p>`
                },
                {
                    id: 3,
                    category: 1,
                    title: "তান্দুরি চিকেন বিরিয়ানি",
                    img: "https://img.freepik.com/premium-photo/bowl-biryani-with-chicken-dish-side_582637-8942.jpg",
                    favorite: false,
                    time: "১ঘন্টা 30মিনিট",
                    people: "৩ জন",
                    content: `<h3> উপকরণ </h3> <p> </p><p>চিকেন টিক্কা তৈরিঃ<br> • চিকেনঃ ১ টি(৮ পিস করে নেয়া)<br> • টক দইঃ ১/২কাপ<br> • লেবুর রসঃ ১ টেবিল চামচ<br> • আদা রসুন বাটা ১ টেবিল চামচ করে<br> • টিক্কা বা তন্দুরী মসলাঃ ২ টেবিল চামচ<br> • মরিচ গুড়াঃ ১চা চামচ<br> • লবনঃ ১চা চামচ<br> • সরিষার তেলঃ ১/৪কাপ<br> <br> উপরের সব উপকরন একসাথে মিশিয়ে কমপক্ষে ৪ ঘন্টা বা সারারাত ফ্রিজে রেখে দিন।<br> প্যানে ২কাপের মত তেল দিয়ে মেরিনেট করা মুরগীর পিসগুলো দিয়ে উচ্চ তাপে রান্না করতে হবে।(বেশি তেলে মুরগী ভাজলে মুরগী পুরে যাবেনা আর ড্রাই ও হবেনা)।মেরিনেটের মশলা রেখে দিন।<br> <br> মুরগিগুলো হাল্কা ভাজ়া হলে তেল থেকে তুলে রাখুন।</p> <p>টিক্কা গ্রেভী তৈরিঃ<br> <br> মেরিনেটেড় মশলা</p> <ul> <li>তেলঃ ১/৪কাপ + ঘিঃ ২ টেবিলচামচ(মুরগী ভাজা তেল ব্যবহার করা যাবে)</li> <li>ধনিয়া ও জিরা গুঁড়ো, গরম মশলা গুড়োঃ ১ চা চামচ করে</li> <li>লবণঃ স্বাদ অনুযায়ী</li> <li>প্যাপরিকা বা মরিচ গুঁড়োঃ ১চা চামচ</li> <li>আদা রসুন পেস্টঃ ১ টেবিল চামচ করে</li> <li>টমেটো কুচিঃ ২ কাপ, পেয়াজ কুচিঃ ১কাপ ও কাঁচামরিচ ফালিঃ ৪-৫টি</li> <li>টমেটো পিউরি ১/২ কাপ•</li> <li>দারুচিনিঃ ৫ টুকরা, সবুজ এলাচঃ ৮টি</li> <li>চিনিঃ ১ চাচাম</li> </ul> <p><br> একটি প্যানে তেল দিয়ে পিয়াজ কুচি, কাঁচামরিচ ও টমেটো গুলোকে নরম করে ভেজে নিয়ে বাকি সব মশলা ও ১/২কাপ পানি দিয়ে একটু কশিয়ে মুরগী গুলো দিয়ে ভাল করে মিশিয়ে আরও কিসুক্ষন কশিয়ে নিন।চিনি দিন।মুরগী মাখা মাখা হলে নামিয়ে নিন।<br> <br> বারবিকিউ ফ্লেভার এর জন্য একটি গরম কয়লা একটি বাটিতে নিয়ে একটু ঘি দিয়ে বাটিটি মুরগীর প্যান এ দিয়ে ঢেকে দিতে হবে ৩-৪ মিনিট।</p> <div> <h3> প্রণালি </h3> <p>চাল প্রস্তুত প্রণালী:<br> উপকরনঃ<br> • বাসমতী চালঃ ৪কাপ বা ৩/৪ কেজি<br> • আদার রসঃ ১ টেবিল চামচ<br> • দারুচিনিঃ ২টুকরা ,এলাচঃ ৩ টি,তেজপাতাঃ ২ টি, শাহি জিরাঃ ১ চা চামচ<br> • কাচামরিচঃ ৫ টি<br> • লবনঃ স্বাদমত<br> <br> চাল ধুয়ে ১ ঘণ্টা ভিজিয়ে রাখুন।<br> পাতিলে ১৫ কাপের মত পানি দিন।আদা বাটা, লবন, আস্ত গরম মশলা ও ১ টেবিল চামচ তেল দিন।<br> চালের পানি ঝরিয়ে পানি ফুটে উঠলে চাল দিয়ে দিন, ৭-৮ মিনিট রান্না করুন। ভাত ৭০% সিদ্ধ হলে চুলা বন্ধ করে ভাত থেকে পানি ঝরিয়ে নিন।<br> <br> বিরিয়ানী প্রস্তুতপ্রণালীঃ<br> • পেয়াজ বেরেস্তাঃ ১কাপ<br> • ১/২চামচ জাফরান , ১ চা চামচ কেওরা জল ১/২ কাপ দুধে গোলানো<br> • গরম মশলা গুড়োঃ ১চা চামচ<br> • ঘিঃ ২ টেবিল চামচ<br> • ধনেপাতা কুচি<br> <br> একটি বড় প্যান নিন।১ টেবিল চামচ ঘি প্যানে মেখে দিন।<br> ২ ভাগের ১ ভাগ ভাত বিছিয়ে দিন।<br> তার উপর মুরগী গ্রেভিসহ বিছিয়ে দিন।<br> এখন অর্ধেক বেরেস্তা, অর্ধেক কেওড়া দুধ ও গরম মশলা মাংশের উপর বিছিয়ে দিন।<br> <br> বাকি ভাত মশলার উপর বিছিয়ে দিন।বাকি দুধ, বেরেস্তা, ঘি ও ধনেপাতা কুচি ছিটিয়ে দিন।<br> ঢাকনা দিয়ে অল্প আচে দমে রাখুন ২০ মিনিট।২০ মিনিট পর চুলা বন্ধ করে ভাত চিকেন মিশিয়ে নিন।<br> <br> কয়লা আগুনে জালিয়ে নিন।জলন্ত কয়লা ফয়েল বা বাটিতে নিয়ে হাড়িতে মাঝখানে ভাতের উপর রাখুন।কয়লার আগুনের উপর ১ চা চামচ ঘিদিন দেখবেন ধুয়া উঠছে।সাথে সাথে ঢাকনা দিয়ে হাড়ি বন্ধ করুন।৫ মিনিট এভাবে রাখুন।<br> নামিয়ে গরম গরম পরিবেশন করুন মজাদার চিকেন টিক্কা বিরিয়ানী।</p>`
                },
                {
                    id: 4,
                    category: 2,
                    title: "চিকেন টিক্কা কাবাব",
                    img: "https://img.freepik.com/free-photo/grilled-skewers-with-vegetables-gray-plate-top-view-ai-generative_123827-24874.jpg",
                    favorite: false,
                    time: "১ ঘন্টা",
                    people: "৪ জন",
                    content: `<h3>উপকরণঃ</h3> <p>চিকেন-৫০০ গ্রাম, টক দধি-১০০ গ্রাম, আদা-১ টেবিল চামচ, রসুন-১ টেবিল চামচ, সয়াসস-১ টেবিল চামচ, কাশ্মিরী মরিচের গুঁড়া- ২ টেবিল চামচ, চাট মশলা-১ চা-চামচ, ওয়েস্টার সস-১ টেবিল চামচ, আমচুর-২ চা চামচ, সরিষার তেল-১/২ কাপ, লেবুর রস ১ টেবিল চামচ, লবণ পরিমানমতো ।</p> <h3>প্রণালীঃ </h3> <p>প্রথমে চিকেন ভালো করে ধুয়ে&nbsp; পানি ঝড়িয়ে নিতে হবে। সব উপকরণ দিয়ে চিকেন মেরিনেট করে ১ ঘন্টা রেখে দিন। এবার তন্দুরি পাত্রে ঘি বা তেল ব্রাশ করে চিকেন ভেঁজে অথবা কয়লার আগুনে জ্বলসে নিন।</p>`
                },
                {
                    id: 5,
                    category: 2,
                    title: "সুতি কাবাব",
                    img: "https://img.freepik.com/free-photo/skewers-with-meat-kebabs-vegetables-rustic-wooden-table-ai-generative_123827-24878.jpg",
                    favorite: true,
                    time: "১ ঘন্টা",
                    people: "৬ জন",
                    content: `<h3> প্রয়োজনীয় উপকরণ:</h3> <ul> <li> মিহি কিমা আধা কেজি (ব্লেন্ড করা)</li> <li> পেঁয়াজ কিউব আধা কাপ</li> <li> কাঁচা মরিচ কুচি ২ টেবিল চামচ</li> <li> বেসন ১ কাপ</li> <li> ধনেপাতা বাটা ২ টেবিল চামচ</li> <li> টেস্টিং সল্ট আধা চা-চামচ</li> <li> আদা বাটা ১ চা-চামচ</li> <li> ডিম ১টা</li> <li> রসুন বাটা ১ চা-চামচ</li> <li> লবণ পরিমাণমতো</li> <li> লাল মরিচের গুঁড়া ১ টেবিল চামচ</li> <li> কাবাব মসলা ১ চা-চামচ</li> <li> সাদা সরিষা বাটা ১ চা-চামচ</li> <li> বাদাম বাটা ১ চা-চামচ</li> <li> পোস্ত দানা বাটা আধা চা-চামচ</li> <li> পেঁপে বাটা ১ চা-চামচ</li> <li> তেল ২ টেবিল চামচ</li> <li> চর্বিছাড়া মাংস আধা কেজি</li> </ul> <h3>প্রস্তুত প্রণালী</h3> <p>প্রথমে সকল প্রকার মসলা ভালো করে মাখিয়ে এক ঘন্টা রেখে দিতে হবে।<br> চর্বি ছাড়া মাংস পাতলা টুকরা করে সামান্য থেঁতলে নিতে হবে।<br> ১ চা-চামচ কাবাব মসলা, ১ চা-চামচ লবণ ও ১ চা-চামচ টেস্টিং সল্ট একসঙ্গে মিশিয়ে ওই থেঁতলানো মাংসের ওপর দিতে হবে।<br> এবার প্রথমে মাংসের টুকরা দিতে হবে।তারপর মাখানো কিমা দিতে হবে।আবার টুকরা, তারপর কিমা দিতে হবে।সবার ওপরে মাংসের টুকরা দিয়ে হাতে নিয়ে গোল করে নিতে হবে। তারপর মাংসের গোলাটি সুতা দিয়ে পেঁচিয়ে নিতে হবে।<br> এরপর ওভেনের ট্রে ও কিমার ওপর হালকা তেল মাখিয়ে নিয়ে ওভেনের ট্রেতে কিমাটি রেখে দিতে হবে।<br> ২৫০ ডিগ্রি সেলসিয়াসে ৩০ মিনিট এবং পরে ১৮০ ডিগ্রিতে ৫ মিনিট রাখতে হবে।<br> কিমা হয়ে এলে ব্রাশ দিয়ে ওপরে গরম মসলার গুঁড়া মেখে নিতে হবে।</p> <p>বি.দ্র: গ্যাসের চুলায় তাওয়া বসিয়ে তার ওপর গ্রিল দিয়েও চুলাতে সুতি কাবাব তৈরি করা যায়।</p>`
                },
            ],
            tips: [
                {
                    id: 1,
                    content: " যথাসম্ভব পাতিলে থাকনা দিয়ে রান্না করুন। এতে করে খাবারের পুষ্টিগুণ ঠিক থাকে।"
                },
                {
                    id: 2,
                    content: "মাংস রান্নার শুরুতেই লবণ না দিয়ে রান্নার মাঝামাঝি সময়ে লবণ দিয়ে ভালোভাবে নাড়ুন। এর পর দেখে নিন পরিমাণ ঠিক হল কিনা।"
                },
                {
                    id: 3,
                    content: "তরকারির ঝোল ঘন করতে চাইলে কিছু কর্ণ ফ্লাওয়ার পানিতে গুলে ঢেলে দিন। লক্ষ্য রাখুন- যেন কর্ণ ফ্লাওয়ারের মিশ্রণটি ভালোমতো তরকারির সঙ্গে মিশে যায়।"
                },
                {
                    id: 4,
                    content: "চাল ধোয়ার পর ১০ মিনিট রেখে দিয়ে তারপর রান্না করুন অথবা রান্নার সময় ১ চা চামচ তেল দিয়ে দিন। দেখবেন ভাত সুন্দর ঝরঝরে হয়েছে।"
                },
                {
                    id: 5,
                    content: "মুরগির ফ্যাট এড়াতে চাইলে চামড়া ছাড়িয়ে মুরগি রান্না করুন। কারণ মুরগির চামড়াতেই প্রধান ফ্যাট থাকে।"
                },
                {
                    id: 6,
                    content: "সবুজ সবজি রান্নার সময় সবুজ রং ঠিক রাখতে চাইলে এক চিমটি চিনি দিন।"
                },
                {
                    id: 7,
                    content: "রান্না করার জন্য একদিন আগেই মাংস সিদ্ধ এবং ঠাণ্ডা করে ফ্রিজে সংরক্ষণ করে রাখতে পারেন।"
                },
                {
                    id: 8,
                    content: "রান্নার সময় গরম পানি ব্যবহার করুন।"
                },
                {
                    id: 9,
                    content: "ফ্রিজের মধ্যে আঁশটে গন্ধ দূর করতে ফ্রিজে এক টুকরো কাঠ কয়লা রেখে দিন।"
                },
                {
                    id: 10,
                    content: "মাংস তাড়াতাড়ি সিদ্ধ করতে চাইলে খোসাসহ এক টুকরো কাঁচা পেঁপে তরকারিতে দিন।"
                },
                {
                    id: 11,
                    content: "মাছ, মাংস বা ডিমের ঝোলে লবণ বেশি হয়ে গেলে তরকারিতে কয়েকটি সিদ্ধ আলু ভেঙে দিন। স্বাদ ঠিক হয়ে যাবে।"
                },
                {
                    id: 12,
                    content: "মুরগির মাংস বা কলিজা রান্নায় ১ টেবিল চামচ সিরকা দিন। এতে মাংসের গন্ধ থাকবে না আবার তাড়াতাড়ি সিদ্ধও হবে।"
                },
                {
                    id: 13,
                    content: "মাছ ভাজার সময় তেল ছিটা রোধ করতে একটু লবণ ছড়িয়ে দিন।"
                },
                {
                    id: 14,
                    content: "বেরেস্তা করার সময় পেঁয়াজ ভেজে নামানোর আগে সামান্য পানি ছিটিয়ে দিন। এতে পেঁয়াজ তাড়াতাড়ি লালচে হবে।"
                },
                {
                    id: 15,
                    content: "কাঁচামাছ বা মাংস ছুরি-চপিং বোর্ডে কাটতে চাইলে বেশ কিছুক্ষণ আগে থেকেই পানিতে ভিজিয়ে নরমাল করে নিন।"
                },
                {
                    id: 16,
                    content: "আলু ও ডিম একসঙ্গে সিদ্ধ করুন, আলাদা কাজে ব্যবহার করলেও তাড়াতাড়ি সিদ্ধ হবে।"
                },
                {
                    id: 17,
                    content: "স্যুপ রান্নার সময় পাতলা হয়ে গেলে দুটি সিদ্ধ আলু ম্যাশ করে স্যুপে মিশিয়ে ফুটিয়ে নিন।"
                },
                {
                    id: 18,
                    content: "ডাল তাড়াতাড়ি রান্না করতে আগের রাতেই ভিজিয়ে রাখুন।"
                },
                {
                    id: 19,
                    content: "সহজে মসলাপাতি খুঁজে পেতে কৌটার গায়ে নাম লিখে রাখুন।"
                },
                {
                    id: 20,
                    content: "আগামী দিন কী রান্না করবেন তার প্রস্তুতি রাতেই নিন, তা হলে সময় বেচে যাবে।"
                },
                {
                    id: 21,
                    content: "রান্না করার সময় অবশ্যই মাছ ও সবজির কম্বিনেশনের ব্যাপারে নজর রাখবেন।"
                },
                {
                    id: 22,
                    content: "মাছ রান্না করে কাঁচা ধনিয়া পাতা থাকলে তা কুচি করে কেটে বিছিয়ে দিন, স্বাদ অনেকগুণ  বেড়ে যাবে।"
                },
                {
                    id: 23,
                    content: "ডালে বাগার দিতে রসুন কুচি তেলে ভেজে ডালে দিয়ে দিন।"
                },
                {
                    id: 24,
                    content: "মাংসজাতীয় রান্না করে শেষে বেরেস্তা (পেঁয়াজ কুচি ভাজি) ছড়িয়ে দিন। এতে স্বাদ বেড়ে যাবে।"
                },
                {
                    id: 25,
                    content: "ডিম সিদ্ধ করতে পানিতে সামান্য লবণ দিয়ে নিন। এতে ডিম খেতে সুস্বাদু হবে। আর ঠাণ্ডা করে ডিম ছিলুন, তা হলে খোসায় লেগে ডিম নষ্ট হবে না।"
                },
                {
                    id: 26,
                    content: "চুলায় হাঁড়ি-পাতিলে ঢাকনা থাকলে তা খালি হাতে ধরবেন না।"
                },
                {
                    id: 27,
                    content: "ভর্তা বানাতে মরিচ খালি হাতে ডলবেন না, এতে হাত জ্বালা করবে।"
                },
                {
                    id: 28,
                    content: "মাছ ভাজতে কড়াই হতে নিদিষ্ট দূরে থাকুন। মাছে পানি থাকলে কিংবা ফুটে আপনার গায়ে বা চোখে তেল পড়তে পারে।"
                },
                {
                    id: 29,
                    content: "শুকনা মরিচ ভাজার সময় মরিচ পোড়ার ঝাঁজে হাঁচি-কাশি রোধে রান্নাঘরের দরজা-জানালা ভালো করে খুলে দিন।"
                },
                {
                    id: 30,
                    content: "ভাজিতে তেল বেশি পড়ে গেলে ভাজিগুলো কড়াই বা প্যানের একদিকে সরিয়ে কড়াই কাত করে কিছুক্ষণ রেখে দিন। তেল ভাজি থেকে ঝরে গেলে সংরক্ষণ করে অন্য প্যান ব্যবহার করতে পারবেন। মাংসের তরকারিতে যদি তেল বেশি হয়ে পড়ে, তবে ওপর থেকে চামচ দিয়ে তেল উঠিয়ে ভাজিতে ব্যবহার করলে ভালোই সুস্বাদু লাগে।"
                },
                {
                    id: 31,
                    content: "এলাচ সম্পূর্ণ গুঁড়ো করে ব্যবহার করা ভালো। এতে এলাচ কামড়ে পড়ে খাওয়ার মজা নষ্ট হবে না। আবার রান্নাতেও সুগন্ধ হবে।"
                },
                {
                    id: 32,
                    content: "সবজির রং ঠিক রাখতে পাতিল ঢেকে রান্না না করাই ভালো। আর কিছু সবজিকে সামান্য সিদ্ধ করে ঠাণ্ডা পানি দিয়ে ধুয়ে ফেললে কিংবা বরফ কুচিতে রাখলে রান্নার পরও রং ঠিক থাকে।"
                },
                {
                    id: 33,
                    content: "কিছু ভাজিতে কড়াইতে তেল গরম হলে, যা দেবেন তার সঙ্গে সামান্য লবণ দিয়ে দিন, তেলের ছিটকা উঠবে না।"
                },
                {
                    id: 34,
                    content: "ডালের মজা বৃদ্ধির জন্য বেশি সময় ধরে রান্না করুন, স্বাদ বেড়ে যাবে।"
                },
                {
                    id: 35,
                    content: "তেলাপিয়া মাছের গন্ধ দূর করতে তেলাপিয়া মাছ হলুদ ও ভিনিগার/লেবুর রস মাখিয়ে মিনিট ১৫ রেখে রান্না করুন।"
                },
                {
                    id: 36,
                    content: "লাল সরষের ঝাঁজ বেশি হয়। হলুদ সরষে ব্যবহার করলে তিতা হয় না। সরষে বাটার সময় লবণ আর কাঁচামরিচ একসঙ্গে বাটলে তিতা হয় না।"
                },
                {
                    id: 37,
                    content: "বর্ষাকালে লবণ গলে যায়, তাই একমুঠো পরিষ্কার চাল পুঁটলি করে বেঁধে লবণের পাত্রে রেখে দিন।"
                },
                {
                    id: 38,
                    content: "কাচের গ্লাসে গরম কিছু নিতে গেলে অনেক সময় ফেটে যায়, তাই গরম কিছু ঢালার আগে গ্লাসে একটি ধাতু নির্মিত চামচ রেখে ঢাললে গ্লাস ফাটবে না।"
                },
                {
                    id: 39,
                    content: " আলু ও আদা বালির মধ্যে ডুবিয়ে রাখলে অনেক দিন পর্যন্ত টাটকা থাকে।"
                },
                {
                    id: 40,
                    content: "যে কোনো খাবার রেফ্রিজারেটরে রাখলে ঢাকনা দিয়ে রাখা ভালো। ফলে এক খাবারের গন্ধ আরেক খাবারে যায় না এবং রেফ্রিজারেটও গন্ধ হয় না।"
                },
                {
                    id: 41,
                    content: "শিশি বা কৌটার মধ্যে বিস্কিট রাখার আগে সামান্য চিনি বা মোটা কাগজের ঠুকরো রেখে দিলে বিস্কিট অনেক দিন মচমচে থাকে।"
                },
                {
                    id: 42,
                    content: "আঙুর, টমেটো প্রভৃতি ফল ফুটন্ত পানিতে ২ মিনিট রেখে সঙ্গে সঙ্গে ঠাণ্ডা পানিতে রেখে দিলে সহজেই খোসা ছড়ানো যায়।"
                },
                {
                    id: 43,
                    content: "চাল ও ডালের কৌটায় কয়েকটি শুকনো নিমপাতা বা শুকনো মরিচ রাখলে সহজে পোকা ধরবে না।"
                },
                {
                    id: 44,
                    content: "কাঁচকলা ও লেবু প্রতিদিন অন্তত এক ঘণ্টা পানিতে ভিজিয়ে রাখলে বেশি দিন টাটকা থাকে।"
                },
                {
                    id: 45,
                    content: "কাঁচামরিচের বোঁটা ফেলে পানি শুকিয়ে কাপড় বা কাগজের প্যাকেটে সংরক্ষণ করলে বেশি দিন ভালো থাকে।"
                },
                {
                    id: 46,
                    content: "চিকেন ফ্রাই, চিকেন রোল— এসব খাবার অ্যালুমিনিয়াম ফয়েলে মুড়িয়ে রাখলে সহজে নষ্ট হয় না।"
                },
                {
                    id: 47,
                    content: "খাবার পুড়ে পাত্রের তলায় আটকে থাকলে পাত্রটিকে নুনপানিতে ভর্তি করে পানি ফোটালে পোড়া অংশ দ্রুত আলাগা হয়ে উঠে যায়।"
                },
                {
                    id: 48,
                    content: "আচার বয়াম থেকে নেওয়ার সময় পরিষ্কার চামচ ব্যবহার করলে আচারে ফাঙ্গাস পড়ে না।"
                },
                {
                    id: 49,
                    content: "চিনির পাত্রের মধ্যে দু-চারটি লবঙ্গ দিয়ে রাখলে পিঁপড়ে ঢুকবে না।"
                },
            ]
        }
    },
    getters: {

    },
    actions: {

    }
});

